bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32D4.xml
                </instance>
                <instance name="VPORT1">
                    <register-group address-space="data" offset="0x0014" name-in-module="VPORT" name="VPORT1"/>
                </instance>
                <instance name="VPORT2">
                    <register-group address-space="data" offset="0x0018" name-in-module="VPORT" name="VPORT2"/>
                </instance>
                <instance name="VPORT3">
                    <register-group address-space="data" offset="0x001C" name-in-module="VPORT" name="VPORT3"/>
                </instance>
                <instance name="PORTA">
                    <register-group address-space="data" offset="0x0600" name-in-module="PORT" name="PORTA"/>
                    <signals>
                        <signal function="PORTA" group="P" index="0" pad="PA0"/>
                        <signal function="PORTA" group="P" index="1" pad="PA1"/>
                        <signal function="PORTA" group="P" index="2" pad="PA2"/>
                        <signal function="PORTA" group="P" index="3" pad="PA3"/>
                        <signal function="PORTA" group="P" index="4" pad="PA4"/>
                        <signal function="PORTA" group="P" index="5" pad="PA5"/>
                        <signal function="PORTA" group="P" index="6" pad="PA6"/>
                        <signal function="PORTA" group="P" index="7" pad="PA7"/>
                    </signals>
                </instance>
                <instance name="PORTB">
                    <register-group address-space="data" offset="0x0620" name-in-module="PORT" name="PORTB"/>
                    <signals>
                        <signal function="PORTB" group="P" index="0" pad="PB0"/>
                        <signal function="PORTB" group="P" index="1" pad="PB1"/>
                        <signal function="PORTB" group="P" index="2" pad="PB2"/>
                        <signal function="PORTB" group="P" index="3" pad="PB3"/>
                    </signals>
                </instance>
                <instance name="PORTC">
                    <register-group address-space="data" offset="0x0640" name-in-module="PORT" name="PORTC"/>
                    <signals>
                        <signal function="PORTC" group="P" index="0" pad="PC0"/>
                        <signal function="PORTC" group="P" index="1" pad="PC1"/>
                        <signal function="PORTC" group="P" index="2" pad="PC2"/>
                        <signal function="PORTC" group="P" index="3" pad="PC3"/>
                        <signal function="PORTC" group="P" index="4" pad="PC4"/>
                        <signal function="PORTC" group="P" index="5" pad="PC5"/>
                        <signal function="PORTC" group="P" index="6" pad="PC6"/>
                        <signal function="PORTC" group="P" index="7" pad="PC7"/>
                    </signals>
                </instance>
                <instance name="PORTD">
                    <register-group address-space="data" offset="0x0660" name-in-module="PORT" name="PORTD"/>
                    <signals>
                        <signal function="PORTD" group="P" index="0" pad="PD0"/>
                        <signal function="PORTD" group="P" index="1" pad="PD1"/>
                        <signal function="PORTD" group="P" index="2" pad="PD2"/>
                        <signal function="PORTD" group="P" index="3" pad="PD3"/>
                        <signal function="PORTD" group="P" index="4" pad="PD4"/>
                        <signal function="PORTD" group="P" index="5" pad="PD5"/>
                        <signal function="PORTD" group="P" index="6" pad="PD6"/>
                        <signal function="PORTD" group="P" index="7" pad="PD7"/>
                    </signals>
                </instance>
                <instance name="PORTE">
                    <register-group address-space="data" offset="0x0680" name-in-module="PORT" name="PORTE"/>
                    <signals>
                        <signal function="PORTE" group="P" index="0" pad="PE0"/>
                        <signal function="PORTE" group="P" index="1" pad="PE1"/>
                        <signal function="PORTE" group="P" index="2" pad="PE2"/>
                        <signal function="PORTE" group="P" index="3" pad="PE3"/>
                    </signals>
                </instance>
                <instance name="PORTR">
                    <register-group address-space="data" offset="0x07E0" name-in-module="PORT" name="PORTR"/>
                    <signals>
                        <signal function="PORTR" group="P" index="0" pad="PR0"/>
                        <signal function="PORTR" group="P" index="1" pad="PR1"/>
                    </signals>
                </instance>
            </module>
            <module name="TC" id="I6090">
                <instance name="TCC0">
                    <register-group address-space="data" offset="0x800" name-in-module="TC0" name="TCC0"/>
                    <signals>
                        <signal field="TC0A" function="TCC" group="OC0A" pad="PC0"/>
                        <signal field="TC0B" function="TCC" group="OC0B" pad="PC1"/>
                        <signal field="TC0C" function="TCC" group="OC0C" pad="PC2"/>
                        <signal field="TC0D" function="TCC" group="OC0D" pad="PC3"/>
                        <signal field="TC0A" function="TCC_ALT" group="OC0A" pad="PC4"/>
                        <signal field="TC0B" function="TCC_ALT" group="OC0B" pad="PC5"/>
                        <signal field="TC0C" function="TCC_ALT" group="OC0C" pad="PC6"/>
                        <signal field="TC0D" function="TCC_ALT" group="OC0D" pad="PC7"/>
                    </signals>
                </instance>
                <instance name="TCC1">
                    <register-group address-space="data" offset="0x840" name-in-module="TC1" name="TCC1"/>
                    <signals>
                        <signal function="TCC" group="OC1A" pad="PC4"/>
                        <signal function="TCC" group="OC1B" pad="PC5"/>
                    </signals>
                </instance>
                <instance name="AWEXC">
                    <register-group address-space="data" offset="0x880" name-in-module="AWEX" name="AWEXC"/>
                    <signals>
                        <signal function="AWEX" group="OC0ALS" pad="PC0"/>
                        <signal function="AWEX" group="OC0AHS" pad="PC1"/>
                        <signal function="AWEX" group="OC0BLS" pad="PC2"/>
                        <signal function="AWEX" group="OC0BHS" pad="PC3"/>
                        <signal function="AWEX" group="OC0CLS" pad="PC4"/>
                        <signal function="AWEX" group="OC0CHS" pad="PC5"/>
                        <signal function="AWEX" group="OC0DLS" pad="PC6"/>
                        <signal function="AWEX" group="OC0DHS" pad="PC7"/>
                    </signals>
                </instance>
                <instance name="HIRESC">
                    <register-group address-space="data" offset="0x890" name-in-module="HIRES" name="HIRESC"/>
