bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA32D4.xml
                <register caption="Pin 0 Control Register" name="PIN0CTRL" offset="0x10" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 1 Control Register" name="PIN1CTRL" offset="0x11" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 2 Control Register" name="PIN2CTRL" offset="0x12" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 3 Control Register" name="PIN3CTRL" offset="0x13" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 4 Control Register" name="PIN4CTRL" offset="0x14" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 5 Control Register" name="PIN5CTRL" offset="0x15" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 6 Control Register" name="PIN6CTRL" offset="0x16" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 7 Control Register" name="PIN7CTRL" offset="0x17" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
            </register-group>
            <value-group caption="Virtual Port 0 Mapping" name="PORTCFG_VP0MAP">
                <value caption="Mapped To PORTA" name="PORTA" value="0x00"/>
                <value caption="Mapped To PORTB" name="PORTB" value="0x01"/>
                <value caption="Mapped To PORTC" name="PORTC" value="0x02"/>
                <value caption="Mapped To PORTD" name="PORTD" value="0x03"/>
                <value caption="Mapped To PORTE" name="PORTE" value="0x04"/>
                <value caption="Mapped To PORTF" name="PORTF" value="0x05"/>
                <value caption="Mapped To PORTG" name="PORTG" value="0x06"/>
                <value caption="Mapped To PORTH" name="PORTH" value="0x07"/>
                <value caption="Mapped To PORTJ" name="PORTJ" value="0x08"/>
                <value caption="Mapped To PORTK" name="PORTK" value="0x09"/>
                <value caption="Mapped To PORTL" name="PORTL" value="0x0A"/>
                <value caption="Mapped To PORTM" name="PORTM" value="0x0B"/>
                <value caption="Mapped To PORTN" name="PORTN" value="0x0C"/>
                <value caption="Mapped To PORTP" name="PORTP" value="0x0D"/>
                <value caption="Mapped To PORTQ" name="PORTQ" value="0x0E"/>
                <value caption="Mapped To PORTR" name="PORTR" value="0x0F"/>
            </value-group>
            <value-group caption="Virtual Port 1 Mapping" name="PORTCFG_VP1MAP">
                <value caption="Mapped To PORTA" name="PORTA" value="0x00"/>
                <value caption="Mapped To PORTB" name="PORTB" value="0x01"/>
                <value caption="Mapped To PORTC" name="PORTC" value="0x02"/>
                <value caption="Mapped To PORTD" name="PORTD" value="0x03"/>
                <value caption="Mapped To PORTE" name="PORTE" value="0x04"/>
                <value caption="Mapped To PORTF" name="PORTF" value="0x05"/>
                <value caption="Mapped To PORTG" name="PORTG" value="0x06"/>
                <value caption="Mapped To PORTH" name="PORTH" value="0x07"/>
                <value caption="Mapped To PORTJ" name="PORTJ" value="0x08"/>
                <value caption="Mapped To PORTK" name="PORTK" value="0x09"/>
                <value caption="Mapped To PORTL" name="PORTL" value="0x0A"/>
                <value caption="Mapped To PORTM" name="PORTM" value="0x0B"/>
                <value caption="Mapped To PORTN" name="PORTN" value="0x0C"/>
                <value caption="Mapped To PORTP" name="PORTP" value="0x0D"/>
                <value caption="Mapped To PORTQ" name="PORTQ" value="0x0E"/>
                <value caption="Mapped To PORTR" name="PORTR" value="0x0F"/>
            </value-group>
